;-----------------------
;Slot UI popups
;-----------------------

[UIFacility_Storage_SparkSlot_NODD]
m_strRepairTitle=РЕМОНТНЫЙ ОТСЕК
m_strRepairText=<XGParam:StrValue0/!UnitName/> можно отремонтировать в этом инженерном ремонтном отсеке, они по прежнему будут доступны для боя. При отправлении на миссию, процесс ремонта будет приостановлен.\nИх нужно будет поместить в отсек, для продолжения ремонта после боя.\nВы хотите продолжить?
m_strRepairTitleStop=ОСТАНОВИТЬ ПРОЦЕСС РЕМОНТА?
m_strRepairTextStop=Вы хотите, чтобы %UNITNAME остановил процесс ремонта?\n\nВНИМАНИЕ: Для продолжения ремонта, юнита необходимо поместить обратно в отсек.
m_strNoSoldiersTooltip=Нет доступных юнитов, для этого ремонтного отсека. 
m_strSoldiersAvailableTooltip=Назначьте юнита, для начала ремонта. 

;-----------------------
; STAFF SLOTS
;-----------------------

[SparkStaffSlot X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: ПОСТРОЙТЕ РОБОТА"

[SparkStaffSlot1 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"

[SparkStaffSlot2 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"

[SparkStaffSlot3 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"

[SparkStaffSlot4 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"

;-----------------------
; DETAILED SOLDIER LISTS
;-----------------------

[X2EventListener_StatusOfRepair]
m_strInRepair = "РЕМОНТИРУЕТСЯ"
